tefilus/MBD_PMSM/exampleSixStep/mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_ert_rtw/mcb_bldc_sixstep_f28069mLaunchPad_closeLoop.h
/*
 * File: mcb_bldc_sixstep_f28069mLaunchPad_closeLoop.h
 *
 * Code generated for Simulink model 'mcb_bldc_sixstep_f28069mLaunchPad_closeLoop'.
 *
 * Model version                  : 7.82
 * Simulink Coder version         : 23.2 (R2023b) 01-Aug-2023
 * C/C++ source code generated on : Mon May 19 17:56:57 2025
 *
 * Target selection: ert.tlc
 * Embedded hardware selection: Texas Instruments->C2000
 * Code generation objectives: Unspecified
 * Validation result: Not run
 */

#ifndef RTW_HEADER_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_h_
#define RTW_HEADER_mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_h_
#ifndef mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_COMMON_INCLUDES_
#define mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_COMMON_INCLUDES_
#include "rtwtypes.h"
#include "c2000BoardSupport.h"
#include "F2806x_Device.h"
#include "F2806x_Gpio.h"
#include "DSP28xx_SciUtil.h"
#include "F2806x_Examples.h"
#include "IQmathLib.h"
#include "MW_SPI.h"
#endif        /* mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_COMMON_INCLUDES_ */

#include "MW_c2000ISR.h"
#include "mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_types.h"
#include "To_LCD.h"
#include "rt_nonfinite.h"
#include "rtGetNaN.h"
#include <string.h>
#include <stddef.h>
#include "MW_target_hardware_resources.h"

/* Macros for accessing real-time model data structure */
#ifndef rtmGetErrorStatus
#define rtmGetErrorStatus(rtm)         ((rtm)->errorStatus)
#endif

#ifndef rtmSetErrorStatus
#define rtmSetErrorStatus(rtm, val)    ((rtm)->errorStatus = (val))
#endif

#ifndef rtmStepTask
#define rtmStepTask(rtm, idx)          ((rtm)->Timing.TaskCounters.TID[(idx)] == 0)
#endif

#ifndef rtmTaskCounter
#define rtmTaskCounter(rtm, idx)       ((rtm)->Timing.TaskCounters.TID[(idx)])
#endif

#define mcb_bldc_sixstep_f28069mLaunchPad_closeLoop_M (mcb_bldc_sixstep_f28069mLaun_M)

extern void init_SCI(void);
extern void init_SCI_GPIO(void);
extern void config_ePWM_GPIO (void);
extern void config_ePWM_TBSync (void);
extern void config_ePWM_XBAR(void);

/* Block signals for system '<S133>/SPI Master Transfer' */
typedef struct {
  uint16_T SPIMasterTransfer;          /* '<S133>/SPI Master Transfer' */
} rtB_SPIMasterTransfer_mcb_bldc_;

/* Block states (default storage) for system '<S133>/SPI Master Transfer' */
typedef struct {
  codertarget_tic2000_blocks_SPIM obj; /* '<S133>/SPI Master Transfer' */
  boolean_T objisempty;                /* '<S133>/SPI Master Transfer' */
} rtDW_SPIMasterTransfer_mcb_bldc;

/* Block signals for system '<Root>/Speed Control' */
typedef struct {
  real32_T Switch;                     /* '<S144>/Switch' */
  real32_T Product;                    /* '<S199>/Product' */
  real32_T UnitDelay;                  /* '<S199>/Unit Delay' */
  real32_T Product1;                   /* '<S199>/Product1' */
  real32_T Add1;                       /* '<S199>/Add1' */
  real32_T Sum;                        /* '<S143>/Sum' */
  real32_T PProdOut;                   /* '<S185>/PProd Out' */
  real32_T Ki2;                        /* '<S143>/Ki2' */
  real32_T Integrator;                 /* '<S180>/Integrator' */
  real32_T Sum_j;                      /* '<S189>/Sum' */
  real32_T DeadZone;                   /* '<S173>/DeadZone' */
  real32_T IProdOut;                   /* '<S177>/IProd Out' */
  real32_T Switch_a;                   /* '<S171>/Switch' */
  real32_T Saturation;                 /* '<S187>/Saturation' */
  int16_T Switch1;                     /* '<S171>/Switch1' */
  int16_T Switch2;                     /* '<S171>/Switch2' */
  boolean_T DataStoreRead2;            /* '<S143>/Data Store Read2' */
  boolean_T DataStoreRead1;            /* '<S144>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S143>/Logical Operator' */
  boolean_T RelationalOperator;        /* '<S171>/Relational Operator' */
  boolean_T fixforDTpropagationissue;/* '<S171>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                    /* '<S171>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S171>/Equal1' */
  boolean_T AND3;                      /* '<S171>/AND3' */
} rtB_SpeedControl_mcb_bldc_sixst;

/* Block states (default storage) for system '<Root>/Speed Control' */
typedef struct {
  real32_T UnitDelay_DSTATE;           /* '<S199>/Unit Delay' */
  real32_T Integrator_DSTATE;          /* '<S180>/Integrator' */
  int16_T Integrator_PrevResetState;   /* '<S180>/Integrator' */
} rtDW_SpeedControl_mcb_bldc_sixs;

/* Block signals (default storage) */
typedef struct {
  real_T PulseGenerator;               /* '<S6>/Pulse Generator' */
  real_T Merge1;                       /* '<S127>/Merge1' */
  real_T Sign;                         /* '<S127>/Sign' */
  real_T ADCThreshold;                 /* '<S126>/ADCThreshold' */
  real_T cu[3];                        /* '<S99>/Switch' */
  real_T Sum;                          /* '<S126>/Sum' */
  uint32_T PositionToCount;            /* '<S104>/PositionToCount' */
  uint32_T Delay;                      /* '<S104>/Delay' */
  real32_T DataStoreRead;              /* '<Root>/Data Store Read' */
  real32_T RT1;                        /* '<Root>/RT1' */
  real32_T RT6;                        /* '<Root>/RT6' */
  real32_T RT3;                        /* '<Root>/RT3' */
  real32_T Abs;                        /* '<S7>/Abs' */
  real32_T RT2;                        /* '<Root>/RT2' */
  real32_T toPU;                       /* '<S126>/toPU' */
  real32_T conductSpeed;               /* '<S126>/conductSpeed' */
  real32_T Idc_ref;                    /* '<S13>/Abs' */
  real32_T DataTypeConversion1[3];     /* '<S97>/Data Type Conversion1' */
  real32_T DataTypeConversion[3];      /* '<S99>/Data Type Conversion' */
  real32_T Sum_o;                      /* '<S97>/Sum' */
  real32_T IDC;                        /* '<S97>/Unary Minus' */
  real32_T Sum_c;                      /* '<S18>/Sum' */
  real32_T PProdOut;                   /* '<S59>/PProd Out' */
  real32_T Kp1;                        /* '<S18>/Kp1' */
  real32_T Integrator;                 /* '<S54>/Integrator' */
  real32_T Sum_e;                      /* '<S63>/Sum' */
  real32_T Sign_b;                     /* '<S13>/Sign' */
  real32_T DeadZone;                   /* '<S47>/DeadZone' */
  real32_T IProdOut;                   /* '<S51>/IProd Out' */
  real32_T Switch;                     /* '<S45>/Switch' */
  real32_T DTC;                        /* '<S120>/DTC' */
  real32_T Product;                    /* '<S103>/Product' */
  real32_T DTC_a;                      /* '<S125>/DTC' */
  real32_T SpeedGain;                  /* '<S104>/SpeedGain' */
  real32_T Product_g;                  /* '<S107>/Product' */
  real32_T UnitDelay;                  /* '<S107>/Unit Delay' */
  real32_T Product1;                   /* '<S107>/Product1' */
  real32_T Add1;                       /* '<S107>/Add1' */
  real32_T Switch_f;                   /* '<S109>/Switch' */
  real32_T Merge;                      /* '<S110>/Merge' */
  real32_T Numberofpolepairs;          /* '<S115>/Number of pole pairs' */
  real32_T Floor;                      /* '<S111>/Floor' */
  real32_T Add;                        /* '<S111>/Add' */
  real32_T DataTypeConversion1_o[6];   /* '<S13>/Data Type Conversion1' */
  real32_T Saturation;                 /* '<S61>/Saturation' */
  real32_T duty[6];                    /* '<S13>/Product' */
  int32_T DataTypeConversion_b[3];     /* '<S97>/Data Type Conversion' */
  int32_T Add_g[3];                    /* '<S97>/Add' */
  int32_T Q17perunitconversion[3];     /* '<S97>/Q17 per unit conversion' */
  int32_T SpeedCount;                  /* '<S104>/SpeedCount' */
  uint16_T Divide;                     /* '<S132>/Divide' */
  uint16_T Divide1;                    /* '<S132>/Divide1' */
  uint16_T Divide2;                    /* '<S132>/Divide2' */
  uint16_T ForIterator;                /* '<S135>/For Iterator' */
  uint16_T IAIBMeasurement[2];         /* '<S135>/IA//IB Measurement' */
  uint16_T ICMeasurement;              /* '<S135>/IC Measurement' */
  uint16_T Memory;                     /* '<S142>/Memory' */
  uint16_T Sum_eu;                     /* '<S142>/Sum' */
  uint16_T Memory1;                    /* '<S142>/Memory1' */
  uint16_T Sum1;                       /* '<S142>/Sum1' */
  uint16_T Memory2;                    /* '<S142>/Memory2' */
  uint16_T Sum2;                       /* '<S142>/Sum2' */
  uint16_T eQEP_o1;                    /* '<S16>/eQEP' */
  uint16_T eQEP_o2;                    /* '<S16>/eQEP' */
  uint16_T speedRef_ADC;               /* '<S16>/speedRef_ADC' */
  uint16_T IAIBMeasurement_p[2];       /* '<S16>/IA//IB Measurement' */
  uint16_T ICMeasurement_l;            /* '<S16>/IC Measurement' */
  uint16_T DataStoreRead_i;            /* '<S97>/Data Store Read' */
  uint16_T DataStoreRead1;             /* '<S97>/Data Store Read1' */
  uint16_T DataStoreRead2;             /* '<S97>/Data Store Read2' */
  uint16_T Switch1[6];                 /* '<S11>/Switch1' */
  uint16_T Output;                     /* '<S90>/Output' */
  uint16_T DataTypeConversion3[3];     /* '<S92>/Data Type Conversion3' */
  uint16_T SCI_Tx_Data[4];             /* '<S14>/Merge' */
  uint16_T SCI_Tx_Iteration;           /* '<S14>/Merge1' */
  uint16_T FixPtSum1;                  /* '<S95>/FixPt Sum1' */
  uint16_T FixPtSwitch;                /* '<S96>/FixPt Switch' */
  uint16_T Merge_g;                    /* '<S103>/Merge' */
  uint16_T Sum3;                       /* '<S117>/Sum3' */
  uint16_T Sum7;                       /* '<S117>/Sum7' */
  uint16_T Data[3];                    /* '<S91>/Data' */
  uint16_T Data_f[3];                  /* '<S93>/Data' */
  uint16_T Data_fw[3];                 /* '<S94>/Data' */
  uint16_T IndexVector;                /* '<S17>/Index Vector' */
  uint16_T Add_gl;                     /* '<S17>/Add' */
  uint16_T Scale_to_PWM_Counter_PRD[6];/* '<S11>/Scale_to_PWM_Counter_PRD' */
  int16_T DataTypeConversion_l[3];     /* '<S92>/Data Type Conversion' */
  int16_T WhileIterator;               /* '<S17>/While Iterator' */
  uint16_T Merge_e;                    /* '<S71>/Merge' */
  uint16_T ShiftArithmetic;            /* '<S87>/Shift Arithmetic' */
  uint16_T A;                          /* '<S87>/Bitwise AND1' */
  uint16_T ShiftArithmetic1;           /* '<S87>/Shift Arithmetic1' */
  uint16_T B;                          /* '<S87>/Bitwise AND2' */
  uint16_T C;                          /* '<S87>/Bitwise AND3' */
  int16_T Switch1_b;                   /* '<S45>/Switch1' */
  int16_T Switch2;                     /* '<S45>/Switch2' */
  boolean_T ONOFF_GPIO6;               /* '<S7>/ON//OFF_GPIO6' */
  boolean_T NOT;                       /* '<S6>/NOT' */
  boolean_T CWCCW_GPIO7;               /* '<S209>/CW//CCW_GPIO7' */
  boolean_T NOT_d;                     /* '<S131>/NOT' */
  boolean_T DataStoreRead_e;           /* '<S127>/Data Store Read' */
  boolean_T Enable;                    /* '<S11>/Enable' */
  boolean_T DataStoreRead1_l;          /* '<S18>/Data Store Read1' */
  boolean_T LogicalOperator;           /* '<S18>/Logical Operator' */
  boolean_T Merge_n[3];                /* '<S74>/Merge' */
  boolean_T Merge_k[6];                /* '<S75>/Merge' */
  boolean_T RelationalOperator;        /* '<S45>/Relational Operator' */
  boolean_T fixforDTpropagationissue; /* '<S45>/fix for DT propagation issue' */
  boolean_T fixforDTpropagationissue1;
                                     /* '<S45>/fix for DT propagation issue1' */
  boolean_T Equal1;                    /* '<S45>/Equal1' */
  boolean_T AND3;                      /* '<S45>/AND3' */
  boolean_T DataTypeConversion_j;      /* '<S87>/Data Type Conversion' */
  boolean_T DataTypeConversion1_d;     /* '<S87>/Data Type Conversion1' */
  boolean_T DataTypeConversion2;       /* '<S87>/Data Type Conversion2' */
  rtB_To_LCD_mcb_bldc_sixstep_f28 To_LCD;/* '<Root>/To_LCD' */
  rtB_SpeedControl_mcb_bldc_sixst SpeedControl;/* '<Root>/Speed Control' */
  rtB_SPIMasterTransfer_mcb_bldc_ SPIMasterTransfer1;/* '<S133>/SPI Master Transfer' */
  rtB_SPIMasterTransfer_mcb_bldc_ SPIMasterTransfer;/* '<S133>/SPI Master Transfer' */
} BlockIO_mcb_bldc_sixstep_f28069;

